In [4]:
dicionario = {
    'produto' : ['coca', 'pepsi', 'guarana', 'suco'],
    'quantidade' : [150, 130, 100, 76],
    'preco' : [1.5, 1.5, 1.2, 3],
    'custo' : [129.99, 109.99, 89.99, 119.99],
    }

In [5]:
#Transformar o dicion√°rio de dados em um DataFrame;
import pandas as pd

df = pd.DataFrame(data=dicionario)
df

   produto  quantidade  preco   custo
0     coca         150    1.5  129.99
1    pepsi         130    1.5  109.99
2  guarana         100    1.2   89.99
3     suco          76    3.0  119.99

In [6]:
#Quanto produtos eu tenho no total?
df['produto'].nunique()

4

In [7]:
#Qual o custo total destes produtos?
sums=df["custo"].sum()
print(" A Soma dos valores do custo foi:")
print(sums)

 A Soma dos valores do custo foi:
449.96000000000004

In [8]:
#Quanto eu lucraria se vendesse todos os produtos (comparando com o custo)?

df['qtde x preco'] = df['quantidade'] * df['preco']
df["lucro"] = df['qtde x preco'] - df['custo']
df

   produto  quantidade  preco   custo  qtde x preco   lucro
0     coca         150    1.5  129.99         225.0   95.01
1    pepsi         130    1.5  109.99         195.0   85.01
2  guarana         100    1.2   89.99         120.0   30.01
3     suco          76    3.0  119.99         228.0  108.01

In [9]:
#Qual o valor total de faturamento (vendendo todos os produtos)?
df['faturamento'] = df['custo'] + df['lucro']
df

   produto  quantidade  preco   custo  qtde x preco   lucro  faturamento
0     coca         150    1.5  129.99         225.0   95.01        225.0
1    pepsi         130    1.5  109.99         195.0   85.01        195.0
2  guarana         100    1.2   89.99         120.0   30.01        120.0
3     suco          76    3.0  119.99         228.0  108.01        228.0

In [10]:
#Qual produto eu obtive maior lucro?
df.groupby(['produto'])['lucro'].sum().nlargest(1)

produto
suco    108.01
Name: lucro, dtype: float64

In [11]:
#Qual produto eu obtive o maior faturamento?
df.groupby(['produto'])['faturamento'].sum().nlargest(1)

produto
suco    228.0
Name: faturamento, dtype: float64